{
  "HEADER": {
    "ABOUT": "About Me",
    "SKILLS": "Skills",
    "PORTFOLIO": "Portfolio",
    "CONTACT": "Contact"
  },
  "LANDING_PAGE": {
    "I_AM": "I am",
    "JOB_TITLE": "Full-Stack Developer",
    "CONTACT_ME": "Let's talk!",
    "SCROLL_DOWN": "Scroll down"
  },
  "ABOUT_ME": {
    "TITLE": "About Me",
    "INTRO_TEXT": "Hi! I'm Jonas Hanke, a Full-Stack Developer from Hünfeld, Germany. My passion is to build functional and modern software solutions that solve real-world problems efficiently.",
    "HISTORY_TEXT": "My professional journey started in robotics simulation and process planning, where I worked for many years on projects for leading companies in the automotive industry. In 2025, I completed a Full-Stack Developer training to expand my expertise in software development.",
    "BACKGROUND_TEXT": "By combining engineering knowledge with web technologies, I bring analytical precision together with creative implementation. I focus on clean code, modern tools such as Angular and TypeScript, and close collaboration with clients and teams."
  },
  "MY_SKILLS": {
    "TITLE": "My skills",
    "TEXT": "I have worked on several projects employing different technologies, applying the following skills along the way.",
    "SUB": "Looking for <span class='accent'>another skill?</span>",
    "COPY": "Reveal enthusiasm for learning new technologies<br>and frameworks.",
    "GET_IN_TOUCH": "Get in touch"
  },
  "MY_PORTFOLIO": {
    "TEXT": "This page presents examples of my work — you are welcome to explore them."
  },
  "PROJECTS": {
    "EL_POLLO_LOCO": {
      "TITLE": "El Pollo Loco",
      "STACK": "JavaScript | HTML | CSS",
      "DESCRIPTION": "A simple Jump-and-Run game based on an object-oriented approach. Help Pepe to find coins and bottles to fight against the chicken attacking the village."
    },
    "Pokedex": {
      "TITLE": "Pokédex",
      "STACK": "JavaScript | HTML | CSS | API",
      "DESCRIPTION": "Based on the PokéAPI a simple library that provides and catalogues pokemon information."
    },
    "Join": {
      "TITLE": "Join",
      "STACK": "Angular | TypeScript | HTML | SCSS | Firebase",
      "DESCRIPTION": "Task manager inspired by the Kanban System. Create and organize tasks using drag and drop functions, assign users and categories."
    }
  },
  "CONTACT_SECTION": {
    "TITLE": "Contact",
    "TEXT": "Got a problem to solve?",
    "CONTENT_ONE": "Contact me through this form. I look forward to hearing from you, learning about your ideas, and contributing to your projects with my work.",
    "CONTENT_TWO": "<span>Need a Full-Stack developer?&nbsp;<b> Contact me!</b></span>"
  },
  "FORM": {
    "NAME_PLACEHOLDER": "Your name",
    "EMAIL_PLACEHOLDER": "Your email",
    "MESSAGE_PLACEHOLDER": "Your message",
    "NAME_VALIDATION_MESSAGE": "Please enter your name.",
    "EMAIL_VALIDATION_MESSAGE": "Please enter a valid email address.",
    "MESSAGE_VALIDATION_MESSAGE": "Please enter a message",
    "SEND_MESSAGE": "Send message :)",
    "MESSAGE_SENT_CONFIRMATION": "The message has been sent successfully!"
  },
  "FOOTER": {
    "IMPRINT": "Legal Notice"
  },
  "IMPRINT": {
    "TITLE": "Legal Notice",
    "SECTION_TITLE": "Imprint",
    "TMG_INFO": "Information according to § 5 TMG",
    "POSTAL_ADDRESS": "Postal address",
    "CONTACT": "Contact",
    "PHONE": "Phone",
    "EMAIL": "E-Mail",
    "WEBSITE_NOTICE": "Website Notice",
    "IMPRINT_GENERATOR": "The imprint was created with the imprint generator of",
    "LINES": {
      "NAMES": "Jonas Hanke",
      "ADDRESS": "Molzbacher Str. 44",
      "POSTCODE_CITY": "36088 Huenfeld",
      "EXPLORING": "Exploring the Board",
      "EMAIL": "Email: jonas.hanke@gmx.net"
    },
    "ACCEPTANCE": {
      "TITLE": "Acceptance of terms",
      "TEXT": "By accessing and using Portfolio (Product), you acknowledge and agree to the following terms and conditions, and any policies, guidelines, or amendments thereto that may be presented to you from time to time. We, the listed students, may update or change the terms and conditions from time to time without notice."
    },
    "SCOPE": {
      "TITLE": "Scope and ownership of the product",
      "TEXT": "Portfolio has been developed as part of a student group project in a web development bootcamp at the Developer Akademie GmbH. It has an educational purpose and is not intended for extensive personal & business usage. As such, we cannot guarantee consistent availability, reliability, accuracy, or any other aspect of quality regarding this Product. The design of Portfolio is owned by the Developer Akademie GmbH. Unauthorized use, reproduction, modification, distribution, or replication of the design is strictly prohibited.",
      "TEXT_1": "Portfolio has been developed as part of a student group project in a web development bootcamp at the Developer Akademie GmbH. It has an educational purpose and is not intended for extensive personal & business usage. As such, we cannot guarantee consistent availability, reliability, accuracy, or any other aspect of quality regarding this Product.",
      "TEXT_2": "The design of Portfolio is owned by the Developer Akademie GmbH. Unauthorized use, reproduction, modification, distribution, or replication of the design is strictly prohibited."
    },
    "PROPRIETARY": {
      "TITLE": "Proprietary rights",
      "TEXT": "Aside from the design owned by Developer Akademie GmbH, we, the listed students, retain all proprietary rights in Portfolio, including any associated copyrighted material, trademarks, and other proprietary information."
    },
    "USE": {
      "TITLE": "Use of the product",
      "TEXT": "Portfolio is intended to be used for lawful purposes only, in accordance with all applicable laws and regulations. Any use of Portfolio for illegal activities, or to harass, harm, threaten, or intimidate another person, is strictly prohibited. You are solely responsible for your interactions with other users of Portfolio."
    },
    "DISCLAIMER": {
      "TITLE": "Disclaimer of warranties and limitation of liability",
      "TEXT": "Portfolio is provided \"as is\" without warranty of any kind, whether express or implied, including but not limited to the implied warranties of merchantability, fitness for a particular purpose, and non-infringement. In no event will we, the listed students, or the Developer Akademie, be liable for any direct, indirect, incidental, special, consequential or exemplary damages, including but not limited to, damages for loss of profits, goodwill, use, data, or other intangible losses, even if we have been advised of the possibility of such damages, arising out of or in connection with the use or performance of Portfolio."
    },
    "INDEMNITY": {
      "TITLE": "Indemnity",
      "TEXT": "You agree to indemnify, defend and hold harmless us, the listed students, the Developer Akademie, and our affiliates, partners, officers, directors, agents, and employees, from and against any claim, demand, loss, damage, cost, or liability (including reasonable legal fees) arising out of or relating to your use of Portfolio and/or your breach of this Legal Notice.",
      "CONTACT_LINE": "For any questions or notices, please contact us at [Contact Email].",
      "DATE": "Date: July 26, 2025"
    }
  },
  "PRIVACY_POLICY": {
    "TITLE": "Privacy Policy",
    "SECTION_1_TITLE": "Privacy at a Glance",
    "GENERAL_NOTES": "General Notes",
    "GENERAL_NOTES_TEXT": "The following notes provide a simple overview of what happens to your personal data when you visit this website. Personal data is all data with which you can be personally identified. Detailed information on the subject of data protection can be found in our Privacy Policy listed below this text.",
    "DATA_COLLECTION": "Data Collection on this Website",
    "DATA_COLLECTION_RESPONSIBILITY": "Who is responsible for data collection on this website?",
    "DATA_PROCESSING": "Data processing on this website is carried out by the website operator. You can find their contact details in the 'Note on the Responsible Body' section of this privacy policy.",
    "HOW_WE_COLLECT_DATA": "How do we collect your data?",
    "HOW_WE_COLLECT_DATA_TEXT": "On the one hand, your data is collected by you providing it to us. This can be data that you enter in a contact form, for example.",
    "HOW_WE_COLLECT_DATA_AUTOMATICALLY": "Other data is collected automatically or with your consent by our IT systems when you visit the website. This primarily includes technical data (e.g. internet browser, operating system, or time of the page view). The collection of this data occurs automatically as soon as you enter the website.",
    "PURPOSE_OF_DATA_USAGE": "What do we use your data for?",
    "DATA_USAGE_PART": "Part of the data is collected to ensure the website is provided error-free. Other data can be used to analyze your user behavior.",
    "YOUR_DATA_RIGHTS": "What rights do you have regarding your data?",
    "YOUR_DATA_RIGHTS_TEXT": "You have the right to obtain information about the origin, recipient, and purpose of your stored personal data at any time, free of charge. You also have the right to request the correction or deletion of this data. If you have given consent to data processing, you can revoke this consent at any time for the future. In addition, you have the right, under certain circumstances, to request the restriction of the processing of your personal data. Furthermore, you have a right to lodge a complaint with the competent supervisory authority.",
    "DATA_PROTECTION_INQUIRIES": "For this and other questions on the subject of data protection, you can contact us at any time.",
    "HOSTING_SECTION_TITLE": "2. Hosting",
    "HOSTING_CONTENT": "We host the content of our website with the following provider:",
    "HOSTING_PROVIDER_TITLE": "Self-hosted (own server)",
    "HOSTING_PROVIDER_DETAILS": "We operate this website on our own server. No external hosting provider is used; therefore, no separate provider privacy policy applies.",
    "HOSTING_PROVIDER_LINK": "",
    "HOSTING_LEGAL_BASE": "Self-hosting is based on Article 6 (1) (f) GDPR. We have a legitimate interest in the technically reliable and secure provision of our website. If corresponding consent has been requested, processing is carried out exclusively on the basis of Article 6 (1) (a) GDPR and Section 25 (1) TTDSG, insofar as the consent includes the storage of cookies or access to information in the user's end device (e.g., device fingerprinting) within the meaning of the TTDSG. Consent can be revoked at any time.",
    "CONTRACT_PROCESSING": "Contract Processing",
    "CONTRACT_PROCESSING_TEXT": "Since hosting is carried out on our own server, no external processor is used for hosting. If we engage service providers for individual processing operations, we conclude data processing agreements (DPAs) with them in accordance with Article 28 GDPR.",
    "GENERAL_INFO_AND_OBLIGATIONS_TITLE": "3. General Notes and Mandatory Information",
    "DATA_PROTECTION": "Data Protection",
    "DATA_PROTECTION_TEXT": "The operators of these pages take the protection of your personal data very seriously. We treat your personal data confidentially and in accordance with the statutory data protection regulations and this privacy policy.",
    "PERSONAL_DATA_COLLECTION": "Various personal data are collected when you use this website. Personal data are data with which you can be personally identified. This privacy policy explains what data we collect and what we use it for. It also explains how and for what purpose this happens.",
    "INTERNET_SECURITY_WARNING": "Please note that data transmission over the Internet (e.g., when communicating by email) may have security vulnerabilities. A complete protection of the data from access by third parties is not possible.",
    "RESPONSIBLE_PARTY_NOTICE": "Note on the responsible entity",
    "RESPONSIBLE_ENTITY": "The responsible entity for data processing on this website is:",
    "RESPONSIBLE_ENTITY_DETAILS": "Jonas Hanke<br />Molzbacher Str. 44<br />36088 Hünfeld",
    "CONTACT_INFO": "Phone: +4915117213405<br />Email: jonas.hanke@gmx.net",
    "RESPONSIBLE_ENTITY_DEFINITION": "The responsible entity is the natural or legal person who alone or jointly with others decides on the purposes and means of processing personal data (e.g., names, email addresses, etc.).",
    "STORAGE_DURATION": "Storage Duration",
    "STORAGE_DURATION_TEXT": "Unless a more specific storage period has been specified within this privacy policy, your personal data will remain with us until the purpose for data processing no longer applies. If you make a justified request for deletion or revoke your consent to data processing, your data will be deleted unless we have other legally permissible reasons for storing your personal data (e.g., tax or commercial law retention periods); in the latter case, deletion will occur after these reasons no longer apply.",
    "LEGAL_BASIS_GENERAL_NOTES": "General Notes on the Legal Basis of Data Processing on This Website",
    "LEGAL_BASIS_FOR_PROCESSING": "If you have given your consent to data processing, we process your personal data based on Article 6 (1) (a) GDPR or Article 9 (2) (a) GDPR if special categories of data are processed according to Article 9 (1) GDPR. In the case of explicit consent to the transfer of personal data to third countries, data processing is also based on Article 49 (1) (a) GDPR. If you have consented to the storage of cookies or to access information on your end device (e.g., via device fingerprinting), the data processing is additionally based on § 25 (1) TTDSG. The consent can be revoked at any time. If your data is necessary for the performance of a contract or for carrying out pre-contractual measures, we process your data based on Article 6 (1) (b) GDPR. Furthermore, we process your data if it is necessary to fulfill a legal obligation based on Article 6 (1) (c) GDPR. Data processing may also be based on our legitimate interest according to Article 6 (1) (f) GDPR. The respective legal bases in each case will be informed in the following paragraphs of this privacy policy.",
    "DATA_RECIPIENTS": "Recipients of Personal Data",
    "DATA_SHARING": "As part of our business activities, we collaborate with various external entities. This collaboration sometimes necessitates the transfer of personal data to these external entities. We only share personal data with external entities when it is required for the fulfillment of a contract, when we are legally obliged to do so (e.g., sharing data with tax authorities), when we have a legitimate interest according to Article 6 (1) (f) GDPR in sharing the data, or when another legal basis allows for the data sharing. When using processors, we share personal data of our customers only based on a valid contract for processing. In case of joint processing, a contract for joint processing is concluded.",
    "REVOCATION_OF_CONSENT": "Revocation of Your Consent to Data Processing",
    "REVOCATION_OF_CONSENT_TEXT": "Many data processing operations are only possible with your explicit consent. You can revoke any previously given consent at any time. The legality of the data processing carried out until the revocation remains unaffected by the revocation.",
    "REVOCATION_OF_CONENT_TEXT": "Many data processing operations are only possible with your explicit consent. You can revoke any previously given consent at any time. The legality of the data processing carried out until the revocation remains unaffected by the revocation.",
    "OBJECTION_RIGHT": "Right to object to processing of your data in specific cases and to direct marketing (Article 21 GDPR)",
    "OBJECTION_RIGHT_TEXT": "IF DATA PROCESSING IS BASED ON ARTICLE 6 (1) (e) OR (f) GDPR, YOU HAVE THE RIGHT AT ANY TIME TO OBJECT TO THE PROCESSING OF YOUR PERSONAL DATA FOR REASONS ARISING FROM YOUR PARTICULAR SITUATION; THIS ALSO APPLIES TO PROFILING BASED ON THESE PROVISIONS. THE RESPECTIVE LEGAL BASIS ON WHICH PROCESSING IS BASED CAN BE FOUND IN THIS PRIVACY POLICY. IF YOU OBJECT, WE WILL NO LONGER PROCESS YOUR AFFECTED PERSONAL DATA UNLESS WE CAN DEMONSTRATE COMPELLING LEGITIMATE GROUNDS FOR THE PROCESSING THAT OVERRIDE YOUR INTERESTS, RIGHTS, AND FREEDOMS, OR THE PROCESSING IS FOR THE ESTABLISHMENT, EXERCISE, OR DEFENSE OF LEGAL CLAIMS (OBJECTION PURSUANT TO ARTICLE 21 (1) GDPR).",
    "OBJECTION_RIGHT_FOR_DIRECT_ADVERTISING": "IF YOUR PERSONAL DATA IS PROCESSED FOR DIRECT MARKETING PURPOSES, YOU HAVE THE RIGHT TO OBJECT AT ANY TIME TO THE PROCESSING OF PERSONAL DATA CONCERNING YOU FOR SUCH MARKETING; THIS ALSO APPLIES TO PROFILING TO THE EXTENT THAT IT IS RELATED TO SUCH DIRECT MARKETING. IF YOU OBJECT, YOUR PERSONAL DATA WILL SUBSEQUENTLY NO LONGER BE USED FOR DIRECT MARKETING PURPOSES (OBJECTION PURSUANT TO ARTICLE 21 (2) GDPR).",
    "RIGHT_TO_COMPLAIN": "Right to lodge a complaint with a supervisory authority",
    "RIGHT_TO_COMPLAIN_TEXT": "In the event of breaches of the GDPR, the data subjects have a right to lodge a complaint with a supervisory authority, in particular in the Member State of their habitual residence, place of work, or place of the alleged infringement. This right to lodge a complaint is without prejudice to any other administrative or judicial remedy.",
    "RIGHT_TO_DATA_PORTABILITY": "Right to data portability",
    "RIGHT_TO_DATA_PORTABILITY_TEXT": "You have the right to receive the data that we process based on your consent or in fulfillment of a contract automatically in a structured, commonly used and machine-readable format. Furthermore, you have the right to transmit those data to another controller without hindrance from us, where technically feasible.",
    "ACCESS_CORRECTION_DELETION": "Access, Correction, and Deletion",
    "ACCESS_CORRECTION_DELETION_TEXT": "Within the scope of the applicable legal provisions, you have the right at any time to free information about your stored personal data, their origin and recipient, and the purpose of the data processing and, if necessary, a right to correction or deletion of these data. For this and other questions on the subject of personal data, you can contact us at any time.",
    "RIGHT_TO_RESTRICTION_OF_PROCESSING": "Right to Restriction of Processing",
    "RIGHT_TO_RESTRICTION_OF_PROCESSING_TEXT": "You have the right to request the restriction of processing of your personal data. You can contact us at any time for this purpose. The right to restriction of processing exists in the following cases:",
    "RESTRICTION_OF_PROCESSING_CONDITIONS": [
      "If you dispute the accuracy of the personal data we hold about you, we usually need time to verify this. For the duration of the review, you have the right to request the restriction of processing of your personal data.",
      "If the processing of your personal data has happened/is happening unlawfully, you can request the restriction of data processing instead of deletion.",
      "If we no longer need your personal data, but you need them for the exercise, defense, or assertion of legal claims, you have the right to request the restriction of processing of your personal data instead of deletion.",
      "If you have lodged an objection under Article 21 (1) GDPR, a balance must be struck between your interests and ours. As long as it has not been determined whose interests prevail, you have the right to request the restriction of processing of your personal data."
    ],
    "RESTRICTED_PROCESSING_DATA_USAGE": "If you have restricted the processing of your personal data, these data - apart from their storage - may only be processed with your consent or for the establishment, exercise, or defense of legal claims or for the protection of the rights of another natural or legal person or for reasons of important public interest of the European Union or of a Member State.",
    "SSL_TLS_ENCRYPTION": "SSL or TLS encryption",
    "SSL_TLS_ENCRYPTION_EXPLANATION": "For security reasons and to protect the transmission of confidential content, such as orders or inquiries you send to us as the site operator, this site uses SSL or TLS encryption. You can recognize an encrypted connection by the fact that the browser's address line changes from „http://“  to „https://“ and by the lock icon in your browser line.",
    "SSL_TLS_ENCRYPTION_EFFECT": "If SSL or TLS encryption is activated, the data you transmit to us cannot be read by third parties.",
    "DATA_COLLECTION_ON_WEBSITE": "4. Data Collection on This Website",
    "CONTACT_FORM": "Contact Form",
    "CONTACT_FORM_TEXT": "If you send us inquiries via the contact form, your information from the inquiry form, including the contact details you provided there, will be stored by us for the purpose of processing the inquiry and in case of follow-up questions. We do not share this information without your consent.",
    "PROCESSING_BASED_ON": "The processing of this data is based on Article 6 (1) (b) GDPR if your inquiry is related to the fulfillment of a contract or is necessary for carrying out pre-contractual measures. In all other cases, the processing is based on our legitimate interest in the effective processing of inquiries addressed to us (Article 6 (1) (f) GDPR) or on your consent (Article 6 (1) (a) GDPR) if it has been requested; the consent can be revoked at any time.",
    "DATA_RETENTION_CONTACT_FORM": "The data entered by you in the contact form will remain with us until you ask us to delete it, revoke your consent to storage, or the purpose for data storage ceases to apply (e.g., after your inquiry has been processed). Mandatory statutory provisions - in particular retention periods - remain unaffected.",
    "INQUIRY_VIA_EMAIL_PHONE_FAX": "Inquiry via Email, Phone, or Fax",
    "INQUIRY_VIA_EMAIL_PHONE_FAX_TEXT": "If you contact us by email, phone, or fax, your inquiry, including all resulting personal data (name, inquiry), will be stored and processed by us for the purpose of handling your request. We do not share this information without your consent.",
    "BASIS_FOR_DATA_PROCESSING": "The processing of this data is based on Article 6 (1) (b) GDPR if your request is related to the fulfillment of a contract or is necessary for carrying out pre-contractual measures. In all other cases, the processing is based on our legitimate interest in the effective processing of inquiries addressed to us (Article 6 (1) (f) GDPR) or on your consent (Article 6 (1) (a) GDPR) if it has been requested; the consent can be revoked at any time.",
    "RETENTION_OF_CONTACT_INQUIRY_DATA": "The data sent to us via contact inquiries remain with us until you ask us to delete them, revoke your consent to storage, or the purpose for data storage ceases to apply (e.g., after the processing of your concern has been completed). Mandatory statutory provisions - in particular retention periods - remain unaffected.",
    "SOURCE": "Source",
    "SOURCE_TEXT": "<a href='https://www.e-recht24.de'>https://www.e-recht24.de</a>"
  },
  "TERMS": {
    "PRIVACY_POLICY": "I've read the",
    "PRIVACY_POLICY_LINK": "Privacy Policy",
    "AGREE_TO_PROCESSING": "and agree to the processing of my data as outlined."
  },
  "REFERENCES": {
    "TITLE": "References",
    "ITEMS": [
      {
        "QUOTE": "Jonas really kept the team together with his great organization and clear communication. We wouldn't have got this far without his commitment.",
        "AUTHOR": "V. Schuster - Team Partner"
      },
      {
        "QUOTE": "Jonas creativity brought fresh ideas that lifted our project to the next level. Her designs always impressed both the team and our clients.",
        "AUTHOR": "A. Keller - UX Designer"
      },
      {
        "QUOTE": "Jonas showed outstanding technical expertise and solved problems faster than anyone else. Without him, the deadline would have been impossible to meet.",
        "AUTHOR": "L. Hoffmann - Project Manager"
      }
    ]
  }
}
